<template>
  <div class="main">
    <Header />
    <div class="policy-card">
      <div class="routers">
        <div class="header-policy">
          <h1 class="policy-header">
            ПОЛИТИКА В ОТНОШЕНИИ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ
          </h1>
        </div>
        <router-link to="/policy" class="router">
          <span class="router-span">Политика</span>
        </router-link>
        <router-link to="/rules" class="router">
          <span class="router-span">Правила</span>
        </router-link>
      </div>
      <section class="references">
        <h5 class="header-references">
          Дата последней редакции: 23 ноября 2020
        </h5>
        <ul>
          <li class="references-li">
            1. <a href="#first" class="references-a">Общие положения</a>
          </li>
          <li class="references-li">
            2.
            <a href="#second" class="references-a"
              >Основные понятия, используемые в Политике</a
            >
          </li>
          <li class="references-li">
            3.
            <a href="#third" class="references-a"
              >Оператор может обрабатывать следующие персональные данные
              Пользователя</a
            >
          </li>
          <li class="references-li">
            4.
            <a href="#fourth" class="references-a"
              >Цели обработки персональных данных</a
            >
          </li>
          <li class="references-li">
            5.
            <a href="#fifth" class="references-a"
              >Правовые основания обработки персональных данных</a
            >
          </li>
          <li class="references-li">
            6.
            <a href="#sixth" class="references-a"
              >Порядок сбора, хранения, передачи и других видов обработки
              персональных данных</a
            >
          </li>
          <li class="references-li">
            7.
            <a href="#seventh" class="references-a"
              >Трансграничная передача персональных данных</a
            >
          </li>
          <li class="references-li">
            8.
            <a href="#eighth" class="references-a">Заключительные положения</a>
          </li>
        </ul>
      </section>
      <div class="content">
        <h3 class="content-header" id="first">1. Общие положения</h3>
        <p class="content-p">
          Настоящая политика обработки персональных данных составлена в
          соответствии с требованиями Федерального закона от 27.07.2006. №152-ФЗ
          «О персональных данных» и определяет порядок обработки персональных
          данных и меры по обеспечению безопасности персональных данных Torgos
          Vent (далее – Оператор).
        </p>
        <p class="content-p">
          Оператор ставит своей важнейшей целью и условием осуществления своей
          деятельности соблюдение прав и свобод человека и гражданина при
          обработке его персональных данных, в том числе защиты прав на
          неприкосновенность частной жизни, личную и семейную тайну.
        </p>
        <p class="content-p">
          Настоящая политика Оператора в отношении обработки персональных данных
          (далее – Политика) применяется ко всей информации, которую Оператор
          может получить о посетителях веб-сайта www.torgos-vent.ru
        </p>
        <h3 class="content-header" id="second">
          2. Основные понятия, используемые в Политике
        </h3>
        <p class="content-p">
          Автоматизированная обработка персональных данных – обработка
          персональных данных с помощью средств вычислительной техники;
          Блокирование персональных данных – временное прекращение обработки
          персональных данных (за исключением случаев, если обработка необходима
          для уточнения персональных данных);
        </p>
        <p class="content-p">
          Веб-сайт – совокупность графических и информационных материалов, а
          также программ для ЭВМ и баз данных, обеспечивающих их доступность в
          сети интернет по сетевому адресу www.torgos-vent.ru;
        </p>
        <p class="content-p">
          Информационная система персональных данных — совокупность содержащихся
          в базах данных персональных данных, и обеспечивающих их обработку
          информационных технологий и технических средств;
        </p>
        <p class="content-p">
          Обезличивание персональных данных — действия, в результате которых
          невозможно определить без использования дополнительной информации
          принадлежность персональных данных конкретному Пользователю или иному
          субъекту персональных данных;
        </p>
        <p class="content-p">
          Обработка персональных данных – любое действие (операция) или
          совокупность действий (операций), совершаемых с использованием средств
          автоматизации или без использования таких средств с персональными
          данными, включая сбор, запись, систематизацию, накопление, хранение,
          уточнение (обновление, изменение), извлечение, использование, передачу
          (распространение, предоставление, доступ), обезличивание,
          блокирование, удаление, уничтожение персональных данных;
        </p>
        <p class="content-p">
          Оператор – государственный орган, муниципальный орган, юридическое или
          физическое лицо, самостоятельно или совместно с другими лицами
          организующие и (или) осуществляющие обработку персональных данных, а
          также определяющие цели обработки персональных данных, состав
          персональных данных, подлежащих обработке, действия (операции),
          совершаемые с персональными данными;
        </p>
        <p class="content-p">
          Персональные данные – любая информация, относящаяся прямо или косвенно
          к определенному или определяемому Пользователю веб-сайта
          www.torgos-vent.ru;
        </p>
        <p class="content-p">
          Пользователь – любой посетитель веб-сайта www.torgos-vent.ru;
        </p>
        <p class="content-p">
          Предоставление персональных данных – действия, направленные на
          раскрытие персональных данных определенному лицу или определенному
          кругу лиц;
        </p>
        <p class="content-p">
          Распространение персональных данных – любые действия, направленные на
          раскрытие персональных данных неопределенному кругу лиц (передача
          персональных данных) или на ознакомление с персональными данными
          неограниченного круга лиц, в том числе обнародование персональных
          данных в средствах массовой информации, размещение в
          информационно-телекоммуникационных сетях или предоставление доступа к
          персональным данным каким-либо иным способом;
        </p>
        <p class="content-p">
          Трансграничная передача персональных данных – передача персональных
          данных на территорию иностранного государства органу власти
          иностранного государства, иностранному физическому или иностранному
          юридическому лицу;
        </p>
        <p class="content-p">
          Уничтожение персональных данных – любые действия, в результате которых
          персональные данные уничтожаются безвозвратно с невозможностью
          дальнейшего восстановления содержания персональных данных в
          информационной системе персональных данных и (или) результате которых
          уничтожаются материальные носители персональных данных.
        </p>
        <h3 class="content-header" id="third">
          3. Оператор может обрабатывать следующие персональные данные
          Пользователя
        </h3>
        <p class="content-p">Электронный адрес</p>
        <p class="content-p">
          Также на сайте происходит сбор и обработка обезличенных данных о
          посетителях (в т.ч. файлов «cookie») с помощью сервисов
          интернет-статистики (Яндекс Метрика и Гугл Аналитика и других).
        </p>
        <p class="content-p">
          Вышеперечисленные данные далее по тексту Политики объединены общим
          понятием Персональные данные.
        </p>
        <h3 class="content-header" id="fourth">
          4. Цели обработки персональных данных
        </h3>
        <p class="content-p">
          Цель обработки персональных данных Пользователя — информирование
          Пользователя посредством отправки электронных писем; заключение,
          исполнение и прекращение гражданско-правовых договоров; предоставление
          доступа Пользователю к сервисам, информации и/или материалам,
          содержащимся на веб-сайте.
        </p>
        <p class="content-p">
          Также Оператор имеет право направлять Пользователю уведомления о новых
          продуктах и услугах, специальных предложениях и различных событиях.
          Пользователь всегда может отказаться от получения информационных
          сообщений, направив Оператору письмо на адрес электронной почты
          info@torgos-vent.ru с пометкой «Отказ от уведомлениях о новых
          продуктах и услугах и специальных предложениях».
        </p>
        <p class="content-p">
          Обезличенные данные Пользователей, собираемые с помощью сервисов
          интернет-статистики, служат для сбора информации о действиях
          Пользователей на сайте, улучшения качества сайта и его содержания.
        </p>
        <h3 class="content-header" id="fifth">
          5. Правовые основания обработки персональных данных
        </h3>
        <p class="content-p">
          Оператор обрабатывает персональные данные Пользователя только в случае
          их заполнения и/или отправки Пользователем самостоятельно через
          специальные формы, расположенные на сайте www.torgos-vent.ru.
        </p>
        <p class="content-p">
          Заполняя соответствующие формы и/или отправляя свои персональные
          данные Оператору, Пользователь выражает свое согласие с данной
          Политикой.
        </p>
        <p class="content-p">
          Оператор обрабатывает обезличенные данные о Пользователе в случае,
          если это разрешено в настройках браузера Пользователя (включено
          сохранение файлов «cookie» и использование технологии JavaScript).
        </p>
        <h3 class="content-header" id="sixth">
          6. Порядок сбора, хранения, передачи и других видов обработки
          персональных данных
        </h3>
        <p class="content-p">
          Безопасность персональных данных, которые обрабатываются Оператором,
          обеспечивается путем реализации правовых, организационных и
          технических мер, необходимых для выполнения в полном объеме требований
          действующего законодательства в области защиты персональных данных.
        </p>
        <p class="content-p">
          Оператор обеспечивает сохранность персональных данных и принимает все
          возможные меры, исключающие доступ к персональным данным
          неуполномоченных лиц.
        </p>
        <p class="content-p">
          Персональные данные Пользователя никогда, ни при каких условиях не
          будут переданы третьим лицам, за исключением случаев, связанных с
          исполнением действующего законодательства.
        </p>
        <p class="content-p">
          В случае выявления неточностей в персональных данных, Пользователь
          может актуализировать их самостоятельно, путем направления Оператору
          уведомление на адрес электронной почты Оператора info@torgos-vent.ru с
          пометкой «Актуализация персональных данных».
        </p>
        <p class="content-p">
          Срок обработки персональных данных является неограниченным.
          Пользователь может в любой момент отозвать свое согласие на обработку
          персональных данных, направив Оператору уведомление посредством
          электронной почты на электронный адрес Оператора info@torgos-vent.ru с
          пометкой «Отзыв согласия на обработку персональных данных».
        </p>
        <h3 class="content-header" id="seventh">
          7. Трансграничная передача персональных данных
        </h3>
        <p class="content-p">
          Оператор до начала осуществления трансграничной передачи персональных
          данных обязан убедиться в том, что иностранным государством, на
          территорию которого предполагается осуществлять передачу персональных
          данных, обеспечивается надежная защита прав субъектов персональных
          данных.
        </p>
        <p class="content-p">
          Трансграничная передача персональных данных на территории иностранных
          государств, не отвечающих вышеуказанным требованиям, может
          осуществляться только в случае наличия согласия в письменной форме
          субъекта персональных данных на трансграничную передачу его
          персональных данных и/или исполнения договора, стороной которого
          является субъект персональных данных.
        </p>
        <h3 class="content-header" id="eighth">8. Заключительные положения</h3>
        <p class="content-p">
          Пользователь может получить любые разъяснения по интересующим
          вопросам, касающимся обработки его персональных данных, обратившись к
          Оператору с помощью электронной почты info@torgos-vent.ru
        </p>
        <p class="content-p">
          В данном документе будут отражены любые изменения политики обработки
          персональных данных Оператором. Политика действует бессрочно до замены
          ее новой версией.
        </p>
        <p class="content-p">
          Актуальная версия Политики в свободном доступе расположена в сети
          Интернет по адресу www.torgos-vent.ru
        </p>
      </div>
    </div>
  </div>
</template>

<script>
import Header from "../components/Header.vue";
export default {
  name: "RulesVue",
  data() {
    return {
      policy: false,
      rules: false,
    };
  },
  components: {
    Header,
  },
  methods: {
    policyActive() {
      this.policy = true;
      this.rules = false;
    },
    rulesActive() {
      this.policy = false;
      this.rules = true;
    },
  },
};
</script>

<style lang="scss" scoped>
* {
  text-decoration: none;
}
.main {
  background-color: black;
}
.policy-card {
  width: 100%;
  padding: 0 10%;
}
.policy-header {
  color: #f3f3f3;
}
.routers {
  margin: auto;
  padding-top: 150px;
}
.router {
  display: inline-block;
  text-align: center;
  color: #f3f3f3;
  background-color: black;
  height: 43.36px;
  border-radius: 10px;
  border: black;
  margin: 70px 10px 30px 10px;
  padding-top: 10px;
  width: 200px;
  background-color: #229aa1;
  transition: 1s;
}
.router:hover {
  background-color: #13d4de;
}
.router:active {
  background-color: #0b4d50;
}
.router-span {
  display: block;
}
.header-policy {
  text-align: left;
}
.references {
  color: #f3f3f3;
  margin-bottom: 100px;
}
.header-references {
  font-family: Poppins;
  font-size: 16px;
  font-weight: 700;
  line-height: 24px;
  letter-spacing: 0em;
  text-align: left;
  margin-bottom: 30px;
}
ul {
  list-style: none;
}
.references-a {
  color: #229aa1;
}
li {
  margin: 10px 0;
}
.content {
  padding-bottom: 150px;
}
.content-header {
  font-family: Poppins;
  font-size: 32px;
  font-weight: 700;
  line-height: 48px;
  text-align: left;
  color: #ffff;
}
.content-p {
  font-family: Poppins;
  font-size: 16px;
  font-weight: 500;
  line-height: 24px;
  letter-spacing: 0em;
  text-align: left;
  color: #f3f3f3;
}
.content-header,
.content-p {
  margin-bottom: 20px;
}
@media (max-width: 1000px) {
  .router {
    width: 150px;
  }
}
@media (max-width: 768px) {
  .references {
    margin-bottom: 50px;
  }
}
@media (max-width: 410px) {
  .policy-header {
    font-size: 25px;
  }
  .router {
    margin-top: 30px;
    width: 130px;
  }
}
@media (max-width: 365px) {
  .policy-header {
    font-size: 20px;
  }
  .router {
    width: 115px;
  }
  ul {
    padding-left: 0px;
  }
}
@media (max-width: 333px) {
  .policy-header {
    font-size: 17px;
  }
  .router {
    width: 105px;
  }
}
</style>
