<template>
  <div class="main">
    <div class="policy-card">
      <div class="routers">
        <div class="header-policy">
          <h1 class="policy-header">ПРАВИЛА ПОЛЬЗОВАНИЯ САЙТОМ</h1>
        </div>
        <router-link to="/policy" class="router">
          <span class="router-span">Политика</span>
        </router-link>
        <router-link to="/rules" class="router">
          <span class="router-span">Правила</span>
        </router-link>
      </div>
      <h5 class="header-references">Дата последней редакции: 23 ноября 2020</h5>
      <div class="content">
        <p class="content-p">
          1. Размещаемая на страницах www.torgos-vent.ru (в дальнейшем Сайт)
          информация предназначена для свободного ознакомления пользователей с
          вопросами, которые могут представлять для них интерес.
        </p>
        <p class="content-p">
          2. Некоторые ссылки на этом Сайте ведут к ресурсам, расположенным на
          сторонних сайтах. Данные ссылки размещены для удобства пользователей и
          не означают, что Администрация одобряет содержание других сайтов.
          Кроме этого, Администрация Сайта не несет никакой ответственности за
          доступность этих ресурсов и за их контент. Это заявление относится ко
          всем ссылкам, представленным на Сайте, и материалам всех веб-сайтов,
          доступных через баннеры и ссылки на веб-сайте www.torgos-vent.ru
        </p>
        <p class="content-p">
          3. Сайт и его Содержимое предоставляются свободно, как акт доброй
          воли, по принципу «как есть», без заключения каких-либо
          договорённостей или договоров между Вами, пользователями данного
          Сайта, Администрацией, владельцами серверов, на которых он размещён,
          либо кем-то ещё, любым образом связанными с этим или родственными ему
          проектами, которые могут стать предметом прямых претензий.
        </p>
        <p class="content-p">
          4. Администрация прикладывает все усилия, чтобы обеспечить
          пользователей точной и достоверной информацией, но в то же время не
          исключает возможности возникновения ошибок.
        </p>
        <p class="content-p">
          5. Администрация не дает каких-либо заверений или гарантий в отношении
          Сайта и его Содержимого, в том числе, без ограничения, в отношении
          своевременности, актуальности, точности, полноты, достоверности,
          доступности или соответствия для какой-либо конкретной цели Сайта и
          Содержимого, в отношении того, что при использовании Сайта не
          возникнет ошибок, оно будет безопасным и бесперебойным, что
          Администрация будет исправлять какие-либо ошибки.
        </p>
        <p class="content-p">
          6. Администрация принимает разумные меры для обеспечения точности,
          актуальности и правомерности Содержимого, но она не принимает на себя
          ответственности за действия лиц или организаций, прямо или иным
          образом осуществленные на основании информации, имеющейся на Сайте или
          полученной через него, как предоставленной Администрацией, так и
          третьими лицами.
        </p>
        <p class="content-p">
          7. За рекламу, размещаемую на Сайте, несет ответственность лишь
          рекламодатель. Сайт особо уведомляет о том, что не гарантирует
          возможность приобретения или использования тех или иных товаров или
          услуг по ценам и/или на условиях, указываемых в рекламных блоках
          (текстах, баннерах). Вы соглашаетесь с тем, что Сайт не несет никакой
          ответственности за возможные последствия (включая любой ущерб),
          возникшие в результате каких-либо отношений с рекламодателями.
        </p>
        <p class="content-p">
          8. На Сайте предусмотрена возможность отправки пользователями
          вопросов, замечаний, предложений и другой информации с целью включения
          её в соответствующие разделы Сайта, которые могут и будут
          использоваться другими его посетителями. Сайт не несет никакой
          ответственности ни за содержание и точность этой информации, ни за
          любые рекомендации или мнения, которые могут в ней содержаться, ни за
          применимость её к конкретным пользователям. Кроме того, поскольку
          интернет не обеспечивает в полной мере надежной защиты информации,
          Сайт не несет ответственности за информацию, присылаемую через
          интернет.
        </p>
        <p class="content-p">
          9. Сайт может использовать идентификационные файлы cookies для
          хранения как вашей личной, так и общей информации. «Cookies»
          представляют собой небольшие текстовые файлы, которые могут
          использоваться интернет-сайтом для опознавания повторных посетителей,
          упрощения доступа и использования посетителем сайта, а также
          отслеживания сайтом обращений посетителей и сбора общей информации для
          улучшения содержания. Пользуясь Сайтом, вы выражаете свое согласие на
          использование Сайтом cookies.
        </p>
        <p class="content-p">
          10. Администрация оставляет за собой право вносить изменения без
          уведомления о них пользователей. Также Администрация не несет
          ответственности за изменение, редактирование или удаление любой
          информации, добавленной вами на Сайт или другие связанные с ним
          проекты.
        </p>
        <p class="content-p">
          11. Администрация вправе отказать в доступе к Сайту любому
          Пользователю, или группе Пользователей без объяснения причин своих
          действий и предварительного уведомления.
        </p>
        <p class="content-p">
          12. Администрация вправе изменять либо удалять ссылки на информацию,
          графические, звуковые и прочие данные, размещенные Пользователями на
          Сайте, без предварительного уведомления и объяснения причин своих
          действий.
        </p>
        <p class="content-p">
          13. Любые торговые марки, знаки и названия товаров, служб и
          организаций, права на дизайн, авторские и смежные права, которые
          упоминаются, используются или цитируются на страницах Сайта,
          принадлежат их законным владельцам и их использование здесь не дает
          вам право на любое другое использование. Если не указано иное,
          страницы данного Сайта никак не связаны с правообладателями, и никто
          кроме правообладателя не может распоряжаться правами на использование
          материалов, защищенных авторским правом. Вы несете ответственность за
          использование этих и подобных материалов.
        </p>
        <p class="content-p">
          14. Чтение, распространение или изменение информации, размещённой на
          данном сайте, может являться нарушением законов той страны, в которой
          вы просматриваете этот сайт.
        </p>
        <p class="content-p">
          15. Пользователь соглашается с тем, что все возможные споры будут
          разрешаться по нормам российского права.
        </p>
        <p class="content-p">Электронный адрес</p>
        <p class="content-p">
          16. Пользователь соглашается с тем, что нормы и законы о защите прав
          потребителей не могут быть применимы к использованию им Сайта,
          поскольку он не оказывает возмездных услуг.
        </p>
        <p class="content-p">
          17. Бездействие со стороны Администрации в случае нарушения
          Пользователем либо группой Пользователей пользовательского соглашения
          не лишает Администрации права предпринять соответствующие действия в
          защиту интересов Сайта позднее.
        </p>
        <p class="content-p">
          18. Все права на материалы, находящиеся на Сайте, охраняются в
          соответствии с законодательством ЕС и РФ, в том числе, об авторском
          праве и смежных правах.
        </p>
        <p class="content-p">
          19. Компоновка страниц, логотип и рисунки, размещенные на данном Сайте
          защищены авторским правом. Администрация Сайта в любое время вправе
          внести изменения в Правила, которые вступают в силу немедленно.
          Продолжение пользования Сайтом после внесения изменений означает Ваше
          автоматическое согласие на соблюдение новых правил.
        </p>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "RulesVue",
  data() {
    return {
      policy: false,
      rules: false,
    };
  },
  methods: {
    policyActive() {
      this.policy = true;
      this.rules = false;
    },
    rulesActive() {
      this.policy = false;
      this.rules = true;
    },
  },
};
</script>

<style lang="scss" scoped>
* {
  text-decoration: none;
}
.main {
  background-color: black;
}
.policy-card {
  width: 100%;
  padding: 0 10%;
}
.policy-header {
  color: #f3f3f3;
}
.routers {
  margin: auto;
  padding-top: 150px;
}
.router {
  display: inline-block;
  text-align: center;
  color: #f3f3f3;
  background-color: black;
  height: 43.36px;
  border-radius: 10px;
  border: black;
  margin: 70px 10px 30px 10px;
  padding-top: 10px;
  width: 200px;
  background-color: #229aa1;
  transition: 1s;
}
.router:hover {
  background-color: #13d4de;
}
.router:active {
  background-color: #0b4d50;
}
.router-span {
  display: block;
}
.header-policy {
  text-align: left;
}
.header-references {
  font-family: Poppins;
  font-size: 16px;
  font-weight: 700;
  line-height: 24px;
  letter-spacing: 0em;
  text-align: left;
  margin-bottom: 30px;
  color: #f3f3f3;
}
ul {
  list-style: none;
}
li {
  margin: 10px 0;
}
.content {
  padding-bottom: 150px;
}
.content-p {
  font-family: Poppins;
  font-size: 16px;
  font-weight: 500;
  line-height: 24px;
  letter-spacing: 0em;
  text-align: left;
  color: #f3f3f3;
}
.content-p {
  margin-bottom: 20px;
}
@media (max-width: 1000px) {
  .router {
    width: 150px;
  }
}
@media (max-width: 410px) {
  .policy-header {
    font-size: 25px;
  }
  .router {
    margin-top: 30px;
    width: 130px;
  }
}
@media (max-width: 365px) {
  .policy-header {
    font-size: 20px;
  }
  .router {
    width: 115px;
  }
  ul {
    padding-left: 0px;
  }
}
@media (max-width: 333px) {
  .policy-header {
    font-size: 17px;
  }
  .router {
    width: 105px;
  }
}
</style>
